hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/receiving/cdm/v1/VaKueOrnAuf_StornoAufhebung_01/STR.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns0:cancelCarrierChange xmlns:ns0="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <ns0:STR-AUF-REC>
                <ns0:absender>
                    <ns0:carrierCode>${carrierCodeAuf}</ns0:carrierCode>
                </ns0:absender>
                <ns0:empfaenger>
                    <ns0:carrierCode>${carrierCodeAbg}</ns0:carrierCode>
                </ns0:empfaenger>
                <ns0:version>0</ns0:version>
                <ns0:endkundenvertragspartner>
                    <ns0:EKPauf>
                        <ns0:carrierCode>${carrierCodeAuf}</ns0:carrierCode>
                    </ns0:EKPauf>
                    <ns0:EKPabg>
                        <ns0:carrierCode>${carrierCodeAbg}</ns0:carrierCode>
                    </ns0:EKPabg>
                </ns0:endkundenvertragspartner>
                <ns0:stornoId>${stornoId}</ns0:stornoId>
                <ns0:vorabstimmungsIdRef>${preAgreementId}</ns0:vorabstimmungsIdRef>
            </ns0:STR-AUF-REC>
        </ns0:cancelCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
